Tekla Open API Reference for Tekla Structures 2025
Cloud.Bulge Property
 The bulge (curve) to use for the cloud (a bulge is the ratio between the height and width of an object).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Bulge { get; set; }
Public Property Bulge As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace